[
 {
  "QuestionID": 1,
  "nr": 1,
  "question": "Metody oceniania złożoności obliczeniowej algorytmu",
  "anwer": "Istnieje wiele różnych metod oceniania złożoności obliczeniowej algorytmu, które można wykorzystać do określenia, ile czasu i zasobów (takich jak pamięć lub procesor) będzie potrzebne do wykonania danego algorytmu. Oto kilka przykładów takich metod:newLineXD1. Ocena złożoności w czasie: Ta metoda mierzy, ile operacji musi wykonać algorytm, aby wykonać swoje zadanie. Złożoność w czasie jest często określana w notacji O(), gdzie n to rozmiar danych wejściowych. Na przykład, jeśli algorytm ma złożoność O(n), oznacza to, że ilość operacji wzrasta proporcjonalnie do rozmiaru danych wejściowych.newLineXD2. Ocena złożoności w pamięci: Ta metoda mierzy, ile pamięci jest potrzebne do przechowywania danych i struktur danychnewLineXDpotrzebnych do wykonania algorytmu. Złożoność w pamięci jest często określana w notacji O().",
  "category": "Kierunkowe"
 },
 {
  "QuestionID": 2,
  "nr": 2,
  "question": "Typologia przestępstw komputerowych",
  "anwer": "Przestępstwa komputerowe to rodzaj przestępstw, które dotyczą komputerów, sieci komputerowych lub systemów informatycznych. Oto kilka przykładów typologii przestępstw komputerowych:newLineXD1. Hacking: Hacking to nielegalne włamanie się do komputera lub sieci komputerowej, aby uzyskać dostęp do poufnych informacji lub kontrolować działanie systemu.newLineXD2. Phishing: Phishing to rodzaj oszustwa, w którym cyberprzestępcy wysyłają fałszywe e-maile lub wiadomości tekstowe, wyglądające jak oficjalne komunikaty od banków lub innych instytucji, aby wyłudzić dane osobowe lub finansowe od ofiar.newLineXD3. Ataki DDoS: Ataki DDoS (Distributed Denial of Service) to rodzaj ataku, w którym cyberprzestępcy wysyłają dużą liczbę żądań do serwera lub sieci, aby zablokować dostęp do niego.newLineXD4. Włamanie do konta: Włamanie do konta to nielegalne uzyskanie dostępu do czyjegoś konta na serwisie internetowym lub aplikacji bez jego zgody.newLineXD5. Krętactwo: Krętactwo to nielegalne modyfikowanie lub niszczenie danych komputerowych.newLineXDnewLineXD",
  "category": "Kierunkowe"
 },
 {
  "QuestionID": 3,
  "nr": 3,
  "question": "Programy służące do DTP",
  "anwer": "DTP (Desktop Publishing) to proces tworzenia dokumentów drukowanych lub elektronicznych za pomocą specjalnych narzędzi i oprogramowania. Oto kilka przykładów programów służących do DTP:newLineXD1. Adobe InDesign: InDesign to profesjonalne narzędzie do tworzenia publikacji cyfrowych i drukowanych, takich jak katalogi, broszury i gazety.newLineXD2. Adobe Illustrator: Illustrator to program do tworzenia grafiki wektorowej, takiej jak loga, ikony i ilustracje.newLineXD3. Adobe Photoshop: Photoshop to narzędzie do edycji zdjęć i obrazów, umożliwiające m.in. retusz, dodawanie efektów i tworzenie grafiki rastrowej.newLineXD4. CorelDRAW: CorelDRAW to program do tworzenia grafiki wektorowej i rastrowej, a także publikacji drukowanych i cyfrowych.newLineXD5. QuarkXPress: QuarkXPress to narzędzie do tworzenia publikacji drukowanych i cyfrowych, takich jak gazety, magazyny i katalogi.newLineXD6. Scribus: Scribus to darmowy program do tworzenia publikacji drukowanych i elektronicznych, takich jak ulotki, broszury inewLineXDgazety.",
  "category": "Kierunkowe"
 },
 {
  "QuestionID": 4,
  "nr": 4,
  "question": "Leasing (operacyjny, finansowy) jako zewnętrzne formy pozyskiwania kapitału",
  "anwer": "Leasing to rodzaj umowy, w której leasingodawca (czyli firma leasingowa) udostępnia leasingobiorcy (czyli przedsiębiorstwu lub osobie prywatnej) konkretny przedmiot (np. samochód, maszynę, sprzęt), a leasingobiorca opłaca comiesięczne raty za jego użytkowanie.newLineXDLeasing może mieć formę operacyjną lub finansową. Leasing operacyjny:newLineXDW leasingu operacyjnym przedmiot leasingu jest wliczany w koszty uzyskania przychodu przez leasingobiorcę. Leasingodawca jest właścicielem przedmiotu leasingu i ponosi jego koszty, a leasingobiorca opłaca comiesięczne raty za użytkowanie przedmiotu. Po zakończeniu okresu leasingu przedmiot może być odkupiony przez leasingobiorcę po określonej cenie lub zwrócony leasingodawcy.newLineXDLeasing finansowy:newLineXDW leasingu finansowym przedmiot leasingu jest wliczany w bilans leasingobiorcy jako jego własność. Leasingobiorca opłaca comiesięczne raty, ale po zakończeniu okresu leasingu automatycznie staje się właścicielem przedmiotu. Leasing jest często wykorzystywany jako zewnętrzna forma pozyskiwania kapitału przez przedsiębiorstwa, ponieważ umożliwia im uzyskanie potrzebnych im środków bez konieczności ich kupowania lub pożyczania. Leasing może być również atrakcyjnym rozwiązaniem dla osób prywatnych, ponieważ umożliwia im korzystanie z przedmiotu leasingu bez konieczności jego natychmiastowego zakupu.newLineXD",
  "category": "Kierunkowe"
 },
 {
  "QuestionID": 5,
  "nr": 5,
  "question": "Klasyczne funkcje trendu jako narzędzie predykcji",
  "anwer": "Trend to względne zmiany wartości danej zmiennej w czasie. Funkcje trendu to matematyczne modele opisujące zmiany trendu w danych. Można je wykorzystać do przewidywania przyszłych wartości zmiennej na podstawie jej dotychczasowych wartości. Oto kilka przykładów klasycznych funkcji trendu:newLineXD1. Prosta funkcja liniowa: Prosta funkcja liniowa to model opisujący liniowy trend w danych. Można ją przedstawić jako równanie postaci y = ax + b, gdzie a i b to stałe, a x to zmienna.newLineXD2. Funkcja wielomianowa: Funkcja wielomianowa to model opisujący złożony trend w danych. Może być przedstawiona jakonewLineXDrównanie postaci y = a0 + a1x + a2x^2 + ... + anx^n, gdzie a0, a1, a2, ..., an to stałe, a x to zmienna.",
  "category": "Kierunkowe"
 },
 {
  "QuestionID": 6,
  "nr": 6,
  "question": "Zagadnienie prawa autorskiego.",
  "anwer": "Prawo autorskie to system prawny, który chroni twórczość literacką, artystyczną i naukową przed nielegalnym kopiowaniem i wykorzystywaniem bez zgody autora. Prawo autorskie obejmuje różnego rodzaju dzieła, takie jak książki, artykuły, filmy, muzykę, zdjęcia itp.newLineXDW większości krajów prawo autorskie przyznaje autorom prawo do decydowania o sposobie wykorzystywania ich dzieł oraz do otrzymywania wynagrodzenia za ich wykorzystanie. Prawo autorskie obejmuje także tzw. prawa pokrewne, które chronią osoby i podmioty, które współtworzą dzieło, takie jak wydawcy, wykonawcy i producenci.newLineXDIstnieją różne sposoby ochrony praw autorskich, takie jak rejestracja dzieła, oznaczanie dzieła symbolem © lub oznaczeniem prawa autorskiego, czy też korzystanie z licencji na korzystanie z dzieła. Prawo autorskie nie jest jednak nieograniczone i istnieją pewne wyjątki, takie jak dozwolony użytek czy cytat, które pozwalają na korzystanie z dzieła bez zgody autora w określonych sytuacjach.newLineXDnewLineXD",
  "category": "Kierunkowe"
 },
 {
  "QuestionID": 7,
  "nr": 7,
  "question": "Cena a popyt i podaż",
  "anwer": "Cena to kwota, którą trzeba zapłacić za określony towar lub usługę. Popyt to ilość danego towaru lub usługi, jaką konsumenci są gotowi kupić w określonym przedziale czasu przy określonej cenie. Podaż to ilość danego towaru lub usługi, jaką producenci są gotowi sprzedać w określonym przedziale czasu przy określonej cenie.newLineXDNa cenę danego towaru lub usługi wpływają zarówno popyt, jak i podaż. Jeśli popyt jest większy niż podaż, cena rośnie, ponieważ konsumenci są gotowi zapłacić więcej za dany towar lub usługę. Jeśli natomiast podaż jest większa niż popyt, cena spada, ponieważ producenci są zmuszeni obniżyć cenę, aby sprzedać swoje towary lub usługi.newLineXDInne czynniki, takie jak koszty produkcji, wysokość podatków czy stopa inflacji, również mogą wpływać na cenę danego towaru lub usługi. W ekonomii cena jest uważana za istotny element rynku, ponieważ odgrywa ważną rolę w alokacji zasobów i wpływa na decyzje konsumentów i producentów.newLineXDnewLineXD",
  "category": "Kierunkowe"
 },
 {
  "QuestionID": 8,
  "nr": 8,
  "question": " Podstawowe aplikacje Internetu",
  "anwer": "Internet to globalna sieć komputerowa, która umożliwia przesyłanie danych pomiędzy komputerami na całym świecie. Podstawowe aplikacje Internetu to narzędzia, które umożliwiają korzystanie z Internetu i jego zasobów. Oto kilka przykładów podstawowych aplikacji Internetu:newLineXD1. Przeglądarka internetowa: Przeglądarka internetowa to oprogramowanie, które umożliwia przeglądanie stron internetowych i korzystanie z różnych usług online. Przykłady przeglądarek internetowych to m.in. Google Chrome, Mozilla Firefox, Internet Explorer czy Safari.newLineXD2. Poczta elektroniczna: Poczta elektroniczna (e-mail) to usługa umożliwiająca wysyłanie i odbieranie wiadomości elektronicznych. Można ją korzystać za pomocą specjalnego oprogramowania lub przez przeglądarkę internetową.newLineXD3. Usługi społecznościowe: Usługi społecznościowe to serwisy internetowe, które umożliwiają komunikowanie się i wymianęnewLineXDinformacji z innymi osobami poprzez profile użytkowników, grupy dyskusyjne czy wiadomości prywatne.",
  "category": "Kierunkowe"
 },
 {
  "QuestionID": 9,
  "nr": 9,
  "question": "Znaczenie UML w procesach tworzenia systemów",
  "anwer": "UML (Unified Modeling Language) to język modelowania obiektowego, który służy do tworzenia graficznych modeli systemów informatycznych. UML jest szeroko stosowany w procesie projektowania i tworzenia oprogramowania, a także w innych dziedzinach, takich jak przemysł, finanse czy nauka o zarządzaniu.newLineXDZnaczenie UML w procesach tworzenia systemów polega na umożliwieniu lepszego zrozumienia i opisania struktur i procesów zachodzących w danym systemie. Dzięki UML możliwe jest zdefiniowanie wymagań dotyczących systemu, opracowanie jego architektury oraz zaprojektowanie poszczególnych elementów systemu i ich wzajemnych interakcji. UML pozwala również na lepszą komunikację pomiędzy zespołami projektowymi oraz na szybsze i bardziej efektywne wykrywanie i rozwiązywanie problemów w procesie tworzenia systemu.newLineXD",
  "category": "Kierunkowe"
 },
 {
  "QuestionID": 10,
  "nr": 10,
  "question": "Pojęcie i klasyfikacja systemów informacyjnych",
  "anwer": "System informacyjny to zestaw narzędzi i procesów, które służą do gromadzenia, przetwarzania, przechowywania i udostępniania informacji. Systemy informacyjne są stosowane w różnych dziedzinach, takich jak biznes, administracja, nauka czy służby publiczne.newLineXDSystemy informacyjne można klasyfikować według różnych kryteriów, takich jak:newLineXD1. Funkcjonalność: Można wyróżnić systemy transakcyjne (które obsługują procesy biznesowe, takie jak sprzedaż czy zamówienia), systemy decyzyjne (które pomagają w podejmowaniu decyzji na podstawie danych), systemy wspomagające zarządzanie (które udostępniają informacje potrzebne do zarządzania przedsiębiorstwem) itp.newLineXD2. Skala: Można wyróżnić systemy lokalne (które obsługują jedną organizację lub instytucję) i systemy rozproszone (które łączą kilka organizacji lub instytucji).newLineXD3. Stopień zaawansowania: Można wyróżnić systemy manualne (które opierają się na ręcznym przetwarzaniu danych), systemy elektroniczne (które wykorzystują komputery do przetwarzania danych) i systemy automatyczne (które posiadają wbudowane mechanizmy decyzyjne).newLineXD4. Obszar zastosowania: Można wyróżnić systemy bazodanowe (które służą do gromadzenia i przechowywania danych), systemy komunikacyjne (które umożliwiają wymianę informacji).newLineXDnewLineXD",
  "category": "Kierunkowe"
 },
 {
  "QuestionID": 11,
  "nr": 11,
  "question": "Problemy określania niezbędnej liczebności próby",
  "anwer": "Określenie niezbędnej liczebności próby jest ważnym elementem projektowania badań naukowych. Próba to grupa osób lub obiektów, która jest badana w celu uzyskania informacji na temat całej populacji (czyli grupy, do której próba należy). W celu uzyskania wiarygodnych wyników badania należy dobrać odpowiednią liczebność próby, tak aby była ona reprezentatywna dla całej populacji.newLineXDProblemy, które mogą wystąpić podczas określania niezbędnej liczebności próby, to m.in.:newLineXD1. Nieznajomość rozkładu cech w populacji: Jeśli nie wiemy, jak rozkładają się poszczególne cechy w populacji (np. płeć, wiek, wykształcenie), trudno jest dobrać odpowiednią liczebność próby.newLineXD2. Nieznajomość poziomu odchyleń w populacji: Jeśli nie wiemy, jaki jest poziom odchyleń w populacji (czyli jak bardzo poszczególne wartości odstają od średniej), trudno jest dobrać odpowiednią liczebność próby.newLineXD3. Nieznajomość poziomu dokładności, jaki chcemy osiągnąć: Im większa dokładność, tym większa liczebność próby jest potrzebna.newLineXD4. Ograniczenia finansowe lub inne praktyczne trudności związane z przeprowadzeniem badania na większej liczebności próby.newLineXDAby uniknąć tych problemów, należy starannie zaplanować badanie i dokładnie określić jego cel, a następnie dobrać odpowiednią liczebność próby na podstawie dostępnych informacji i ograniczeń.newLineXDnewLineXD",
  "category": "Kierunkowe"
 },
 {
  "QuestionID": 12,
  "nr": 12,
  "question": "Statystyczne testy istotności",
  "anwer": "Statystyczne testy istotnościnewLineXDStatystyczne testy istotności to narzędzia, które służą do oceny, czy różnice między grupami lub zmiennymi są istotne statystycznie. Testy istotności pozwalają na weryfikację hipotez badawczych, tzn. stwierdzenia, czy dane zaobserwowane w badaniu są zgodne z oczekiwaniami, czy też różnią się od nich na tyle, że można uznać je za istotne.newLineXDIstnieje wiele różnych testów istotności, które różnią się między sobą sposobem obliczania p-value (czyli prawdopodobieństwa, że dane zaobserwowane w badaniu wystąpiłyby przez przypadek). Jeśli p-value jest mniejsze niż ustalony poziom istotności (np. 0,05), oznacza to, że różnice między grupami lub zmiennymi są istotne statystycznie i można odrzucić hipotezę zerową (czyli, że nie ma różnic między grupami lub zmiennymi).newLineXDPrzykłady testów istotności to m.in.: test t-Studenta, test złożonego zerowego rozkładu chi-kwadrat, test U Manna-Whitneya, test Fishera. Do wyboru odpowiedniego testu istotności należy brać pod uwagę charakter badanej zmiennej (ciągła czy dyskretna) oraz liczebność i homogeniczność grup.newLineXD",
  "category": "Kierunkowe"
 },
 {
  "QuestionID": 13,
  "nr": 13,
  "question": "Zastosowania sztucznej inteligencji w zarządzaniu",
  "anwer": "Sztuczna inteligencja (AI) to dziedzina informatyki, która zajmuje się tworzeniem systemów komputerowych, które są w stanie samodzielnie myśleć, uczyć się i rozwiązywać problemy. AI może być wykorzystywana w wielu różnych dziedzinach, w tym także w zarządzaniu. Oto kilka przykładów zastosowań sztucznej inteligencji w zarządzaniu:newLineXD1. Automatyzacja procesów: AI może być wykorzystywana do automatyzacji rutynowych procesów zarządczych, takich jak księgowość, fakturowanie czy raportowanie.newLineXD2. Predykcja trendów: AI może być wykorzystywana do analizy danych i przewidywania przyszłych trendów w różnych obszarach, takich jak sprzedaż, rynek pracy czy rynek finansowy.newLineXD3. Analiza danych: AI może być wykorzystywana do analizy dużych ilości danych i wyciągania z nich wniosków. Może to pomócnewLineXDw lepszym zrozumieniu potrzeb klientów",
  "category": "Kierunkowe"
 },
 {
  "QuestionID": 14,
  "nr": 14,
  "question": "Bariery wdrożeń systemów informatycznych",
  "anwer": "Wdrożenie systemu informatycznego to proces, w którym nowe oprogramowanie jest instalowane i uruchamiane w firmie lub instytucji. Wdrożenie systemu może być skomplikowane i wymagać dużego nakładu czasu, pracy i środków. Oto kilka przykładów barier, które mogą pojawić się podczas wdrożenia systemu informatycznego:newLineXD1. Koszty: Wdrożenie systemu informatycznego wiąże się zazwyczaj z wysokimi kosztami, w tym kosztami zakupu oprogramowania, kosztami instalacji i konfiguracji, kosztami szkolenia pracowników itp.newLineXD2. Złożoność techniczna: Wdrożenie systemu informatycznego może być skomplikowane z technicznego punktu widzenia, zwłaszcza jeśli system jest duży i złożony. Może być konieczne zaangażowanie specjalistów z różnych dziedzin, takich jak programowanie, sieci komputerowe czy bezpieczeństwo.newLineXD3. Opór ze strony pracowników: Wdrożenie systemu informatycznego może spotkać się z oporem ze strony pracowników,newLineXDktórzy boją się zmian systemowych.",
  "category": "Kierunkowe"
 },
 {
  "QuestionID": 15,
  "nr": 15,
  "question": "Algorytm, sposoby zapisu algorytmów",
  "anwer": "Algorytm to schemat postępowania, który służy do rozwiązania określonego problemu lub wykonania konkretnej czynności. Algorytm jest zbiorem kroków, które należy wykonać według określonej kolejności, aby osiągnąć zamierzony rezultat. Algorytmy są szeroko stosowane w informatyce, ale można je również zastosować w innych dziedzinach, takich jak matematyka, ekonomia czy nawet w codziennych czynnościach.newLineXDIstnieje wiele sposobów zapisywania algorytmów, w zależności od potrzeb i celu. Oto kilka przykładów sposobów zapisu algorytmów:newLineXD1. Diagram blokowy: Diagram blokowy to graficzny sposób zapisu algorytmu, w którym poszczególne kroki są przedstawione jako bloki połączone strzałkami. Diagram blokowy jest szczególnie przydatny do prezentowania algorytmów prostych i łatwych do zrozumienia.newLineXD2. Struktura drzewiasta: Struktura drzewiasta to sposób zapisu algorytmu, w którym kroki są przedstawione jako gałęzie i liście drzewa. Ten sposób zapisu jest szczególnie przydatny do prezentowania algorytmów, które składają się z wielu zagnieżdżonych kroków.newLineXD3. Składnia języka programowania: Algorytm może być również zapisany w języku programowania, takim jak C++, Python czy Java. W takim przypadku należy stosować odpowiednią składnię danego języka, aby algorytm był poprawny i mógł być wykonywany przez komputer.newLineXDnewLineXD",
  "category": "Kierunkowe"
 },
 {
  "QuestionID": 16,
  "nr": 16,
  "question": "Etapy badania statystycznego",
  "anwer": "Badanie statystyczne to proces, w którym badacz szuka odpowiedzi na pytania badawcze za pomocą analizy danych. Badanie statystyczne składa się zazwyczaj z następujących etapów:newLineXD1. Określenie celu i hipotez: Pierwszym krokiem w badaniu statystycznym jest określenie celu badania oraz hipotez badawczych, czyli stwierdzeń, które chce się weryfikować.newLineXD2. Zebranie danych: Następnym krokiem jest zebranie danych, które będą niezbędne do weryfikacji hipotez. Może to obejmować zarówno dane ilościowe, jak i jakościowe.newLineXD3. Przygotowanie danych: Kolejnym krokiem jest przygotowanie danych do analizy, co może obejmować m.in. usunięcie błędów, braków czy odstępstw od normy.newLineXD4. Analiza danych: Kolejnym etapem jest analiza danych, w której wykorzystuje się odpowiednie narzędzia statystyczne do weryfikacji hipotez badawczych.newLineXD5. Interpretacja wyników: Na koniec należy dokonać interpretacji wyników i wyciągnąć wnioski z badania.newLineXDOczywiście, powyższe etapy nie są sztywno określone i w rzeczywistości mogą się nieco różnić w zależności od rodzaju badania i potrzeb.",
  "category": "Kierunkowe"
 },
 {
  "QuestionID": 17,
  "nr": 17,
  "question": "Edytory tekstów.",
  "anwer": "Edytory tekstu to oprogramowanie służące do tworzenia, edycji i formatowania tekstu. Edytory tekstu są szeroko stosowane w różnych dziedzinach, od pisania dokumentów biurowych po tworzenie kodu źródłowego. Oto kilka przykładów popularnych edytorów tekstu:newLineXD1. Microsoft Word: Microsoft Word to popularny edytor tekstu dla systemu Windows. Oferuje szeroki zakres narzędzi do tworzenia i edycji dokumentów, w tym opcje formatowania tekstu, wstawiania obrazów i tabel.newLineXD2. Google Docs: Google Docs to edytor tekstu dostępny w chmurze, który umożliwia tworzenie i edycję dokumentów online. Można go używać z dowolnego urządzenia z dostępem do internetu.newLineXD3. Sublime Text: Sublime Text to edytor tekstu przeznaczony głównie do tworzenia kodu źródłowego. Posiada szereg narzędzi, takich jak automatyczne uzupełnianie kodu czy podświetlanie składni, które ułatwiają pracę z kodem.newLineXD4. Notepad++: Notepad++ to kolejny edytor tekstu przeznaczony do tworzenia kodu źródłowego. Jest dostępny dla systemu Windows i oferuje podobne narzędzia jak Sublime Text.newLineXD5. Vim: Vim to edytor tekstu dostępny dla wielu systemów operacyjnych, w tym Linux, macOS i Windows. Jest szczególnie popularny wśród programistów i oferuje szeroki zakres narzędzi do tworzenia i edycji kodu źródłowego.newLineXDnewLineXD",
  "category": "Kierunkowe"
 },
 {
  "QuestionID": 18,
  "nr": 18,
  "question": "Znaczenie skrótów MRP-II, ERP, CRM w odniesieniu do systemów informatycznych w zarządzaniu.",
  "anwer": "MRP-II (ang. Manufacturing Resource Planning) to system informatyczny służący do planowania zasobów produkcyjnych. MRP-II jest rozszerzeniem systemu MRP (ang. Material Requirements Planning) i umożliwia zarządzanie całym procesem produkcyjnym, od zamówień po dostawy.newLineXDERP (ang. Enterprise Resource Planning) to system informatyczny służący do zarządzania zasobami przedsiębiorstwa. ERP łączy w jednym systemie różne obszary działalności przedsiębiorstwa, takie jak ﬁnanse, księgowość, zarządzanie produkcją, zaopatrzenie czy kadry.newLineXDCRM (ang. Customer Relationship Management) to system informatyczny służący do zarządzania relacjami z klientami. CRM umożliwia zbieranie i analizę danych dotyczących klientów, a także planowanie i realizację działań marketingowych i sprzedażowych.newLineXDMRP-II, ERP i CRM to przykłady systemów informatycznych, które są szeroko stosowane w zarządzaniu przedsiębiorstwem. Pozwalają one zwiększyć efektywność i skuteczność działania, a także umożliwiają lepsze zarządzanie zasobami i relacjami z klientami.newLineXDnewLineXD",
  "category": "Kierunkowe"
 },
 {
  "QuestionID": 19,
  "nr": 19,
  "question": "Kontrola finansowa i audyt wewnętrzny",
  "anwer": "Kontrola ﬁnansowa to proces, w którym sprawdza się prawidłowość i rzetelność danych ﬁnansowych oraz zgodność z obowiązującymi przepisami i procedurami. Kontrola ﬁnansowa może być prowadzona przez wewnętrzny dział kontroli lub przez zewnętrzne ﬁrmy audytorskie. Audyt wewnętrzny to rodzaj kontroli ﬁnansowej, która jest prowadzona przez wyznaczonych pracowników lub zewnętrznych specjalistów zatrudnionych przez przedsiębiorstwo. Audyt wewnętrzny ma na celu ocenę skuteczności i efektywności działania przedsiębiorstwa oraz zgodności z obowiązującymi przepisami i standardami. Kontrola ﬁnansowa i audyt wewnętrzny są ważnymi narzędziami zarządzania, które pozwalają zapewnić transparentność i rzetelność działania przedsiębiorstwa oraz zminimalizować ryzyko błędów i nieprawidłowości.newLineXD",
  "category": "Kierunkowe"
 },
 {
  "QuestionID": 20,
  "nr": 20,
  "question": "Geneza i istota Internetu",
  "anwer": "Internet to globalna sieć połączonych ze sobą komputerów, która umożliwia przesyłanie danych i komunikację między użytkownikami na całym świecie. Internet powstał w latach 60. XX wieku jako projekt badawczy amerykańskiej armii, który miał na celu stworzenie sieci komputerów, która byłaby odporna na awarię i zapewniała możliwość przesyłania danych w razie wojny. Geneza Internetu wiąże się z rozwojem sieci komputerowych i technologii komunikacyjnych. W pierwszych latach istnienia Internet składał się z kilku niezależnych sieci komputerowych, które stopniowo połączono w jedną globalną sieć. W latach 80. Internet stał się dostępny dla szerokiej publiczności, a w latach 90. rozpoczął swój dynamiczny rozwój, który trwa do dziś. Obecnie Internet jest jednym z najważniejszych narzędzi komunikacyjnych i informacyjnych, umożliwiając dostęp do ogromnych zasobów informacji, usług i aplikacji online. Jest również ważnym narzędziem gospodarczym, umożliwiając m.in. handel i usługi online.",
  "category": "Kierunkowe"
 },
 {
  "QuestionID": 21,
  "nr": 21,
  "question": "Systemy ekspertowe, definicja, przykłady.",
  "anwer": "Systemy ekspertowe to specjalne rodzaje oprogramowania, które są zaprojektowane do automatycznego rozwiązywania złożonych problemów i podejmowania decyzji na podstawie zgromadzonej wiedzy i doświadczenia. Systemy ekspertowe wykorzystują algorytmy sztucznej inteligencji oraz specjalistyczną wiedzę z danej dziedziny, taką jak medycyna czy inżynieria, do rozwiązywania problemów i podejmowania decyzji. Systemy ekspertowe są często stosowane w obszarach, w których wymagana jest wiedza specjalistyczna i szybkie podejmowanie decyzji, takich jak diagnostyka medyczna czy planowanie produkcji. Oto kilka przykładów systemów ekspertowych: 1. System ekspertowy do diagnostyki medycznej: System ekspertowy do diagnostyki medycznej wykorzystuje algorytmy sztucznej inteligencji do analizy objawów i danych diagnostycznych pacjenta, a następnie sugeruje możliwe rozpoznania i leczenie. 2. System ekspertowy do planowania produkcji: System ekspertowy do planowania produkcji wykorzystuje dane dotyczące dostępności surowców i zamówień oraz ograniczeń produkcyjnych, aby zaproponować optymalny plan produkcji. 3. System ekspertowy do podejmowania decyzji ﬁnansowych: System ekspertowy do podejmowania decyzji ﬁnansowych analizuje dane dotyczące sytuacji ﬁnansowej przedsiębiorstwa i sugeruje optymalne strategie inwestycyjne lub ﬁnansowanie. Systemy ekspertowe są coraz powszechniej stosowane w różnych dziedzinach, gdyż umożliwiają automatyzację trudnych i czasochłonnych zadań oraz podejmowanie decyzji na podstawie specjalistycznej wiedzy. ",
  "category": "Kierunkowe"
 },
 {
  "QuestionID": 22,
  "nr": 22,
  "question": "Funkcje i rodzaje systemów wynagradzania",
  "anwer": "Systemy wynagradzania są zestawami zasad i procedur, które regulują sposób naliczania i wypłacania wynagrodzeń pracownikom w przedsiębiorstwie. Funkcje systemów wynagradzania to m.in.: 1. Motywacyjna: Systemy wynagradzania powinny motywować pracowników do osiągania lepszych wyników i rozwoju zawodowego. 2. Sprawiedliwa: Systemy wynagradzania powinny być sprawiedliwe i równe dla wszystkich pracowników, bez względu na ich płeć, rasę czy pochodzenie. 3. Efektywna: Systemy wynagradzania powinny być efektywne i przyczyniać się do osiągania celów przedsiębiorstwa. 4. Elastyczna: Systemy wynagradzania powinny być elastyczne i uwzględniać indywidualne potrzeby i oczekiwania pracowników. Rodzaje systemów wynagradzania to m.in.: 1. Wynagrodzenie ryczałtowe: Pracownik otrzymuje stałą kwotę wynagrodzenia, bez względu na ilość pracy lub osiągnięte wyniki. 2. Wynagrodzenie godzinowe: Pracownik otrzymuje wynagrodzenie za każdą godzinę pracy. 3. Wynagrodzenie za wynik: Pracownik otrzymuje wynagrodzenie zależne od osiągniętych wyników lub wydajności. 4. Wynagrodzenie hybrydowe: Łączy elementy kilku rodzajów wynagrodzenia, takie jak wynagrodzenie ryczałtowe i wynagrodzenie za wynik. Systemy wynagradzania są ważnym narzędziem zarządzania przedsiębiorstwem, ponieważ odgrywają istotną rolę w motywowaniu pracowników i zapewnianiu sprawiedliwości i efektywności. ",
  "category": "Kierunkowe"
 },
 {
  "QuestionID": 23,
  "nr": 23,
  "question": "Różnice między podejściem proceduralnym a obiektowym w projektowaniu systemów informatycznych",
  "anwer": "Podejście proceduralne to sposób projektowania systemów informatycznych, w którym nacisk kładziony jest na procesy i algorytmy, a mniejsze znaczenie ma struktura danych i obiektów. W podejściu proceduralnym program składa się z ciągu instrukcji, które opisują, co system ma robić w danej sytuacji. Podejście obiektowe to sposób projektowania systemów informatycznych, w którym nacisk kładziony jest na strukturę danych i obiektów oraz ich relacje i interakcje. W podejściu obiektowym program składa się z obiektów, które posiadają atrybuty (dane) i metody (funkcje), a także mogą komunikować się z innymi obiektami. Oto kilka głównych różnic między podejściem proceduralnym a obiektowym:  Struktura danych: W podejściu proceduralnym struktura danych jest mniej ważna niż algorytmy, natomiast w podejściu obiektowym struktura danych jest kluczowa i oparta na obiektach.  Modularność: Podejście proceduralne często prowadzi do tworzenia monolitycznych programów, natomiast podejście obiektowe umożliwia tworzenie bardziej modularnych programów, składających się z niezależnych obiektów. ",
  "category": "Kierunkowe"
 },
 {
  "QuestionID": 24,
  "nr": 24,
  "question": "Podstawowe zasady rachunkowości",
  "anwer": "Rachunkowość jest dziedziną nauki, która zajmuje się zbieraniem, przechowywaniem i interpretacją danych ﬁnansowych. Podstawowe zasady rachunkowości to:  Zasada rzetelności: Wszystkie dane ﬁnansowe powinny być rzetelne i wiarygodne.  Zasada użyteczności: Informacje ﬁnansowe powinny być użyteczne i przydatne dla osób, które z nich korzystają.  Zasada sprawiedliwości: Wszystkie transakcje powinny być wycenione w sposób sprawiedliwy i obiektywny.  Zasada odpowiedzialności: Wszystkie transakcje powinny być rejestrowane i przypisane odpowiednim podmiotom.  Zasada przejrzystości: Informacje ﬁnansowe powinny być jasno i czytelnie przedstawione.  Zasada równoważności: Wszystkie transakcje powinny być rejestrowane w obu kierunkach (np. koszty powinny być ujęte wraz z przychodami). ",
  "category": "Kierunkowe"
 },
 {
  "QuestionID": 25,
  "nr": 25,
  "question": "Istota metody reprezentacyjnej, populacja generalna i próba",
  "anwer": "Metoda reprezentacyjna to sposób badania dużych grup ludzi, tzw. populacji generalnej, poprzez próbę, czyli mniejszą grupę osób, która ma reprezentować całą populację. Celem metody reprezentacyjnej jest wyciągnięcie wniosków na temat całej populacji na podstawie badania próby. Populacja generalna to cała grupa osób, która spełnia określone kryteria i jest przedmiotem badań. Próba to mniejsza grupa osób, która jest reprezentatywna dla całej populacji i jest badana w celu wyciągnięcia wniosków na temat całej populacji. Aby próba była reprezentatywna, należy ją dobierać tak, aby jej skład odpowiadał składowi populacji generalnej pod względem takich czynników, jak wiek, płeć, pochodzenie etniczne itp. Metoda reprezentacyjna jest stosowana w wielu dziedzinach, takich jak socjologia, marketingu, medycyna czy polityka, w celu uzyskania wiarygodnych wyników badań na temat danej populacji. ",
  "category": "Kierunkowe"
 },
 {
  "QuestionID": 26,
  "nr": 26,
  "question": "Przykłady liniowych i nieliniowych problemów optymalizacyjnych.",
  "anwer": "Liniowe problemy optymalizacyjne to takie, w których funkcja celu oraz ograniczenia są liniowe. Przykłady takich problemów to:  Minimalizacja kosztów produkcji przy określonym zapotrzebowaniu na poszczególne produkty.  Maksymalizacja zysku przy określonych ograniczeniach produkcji i zapotrzebowaniu na produkty. Nieliniowe problemy optymalizacyjne to takie, w których funkcja celu lub ograniczenia są nieliniowe. Przykłady takich problemów to:  Optymalizacja trasy podróży samochodem, uwzględniając ograniczenia terenowe oraz koszty paliwa.  Optymalizacja projektu budowlanego, uwzględniając ograniczenia terenowe oraz koszty materiałów i robocizny. ",
  "category": "Kierunkowe"
 },
 {
  "QuestionID": 27,
  "nr": 27,
  "question": "Różnice między grafiką rastrową i wektorową",
  "anwer": "Graﬁka rastrowa (bitmapowa) to sposób przedstawiania obrazów, w którym obraz jest składany z kolorowych pikseli (punctiforms). Każdy piksel jest indywidualnym elementem obrazu i jest reprezentowany przez określoną liczbę bitów, która określa jego kolor. Graﬁka rastrowa jest dobra do przedstawiania szczegółowych obrazów, takich jak zdjęcia. Graﬁka wektorowa to sposób przedstawiania obrazów, w którym obraz jest składany z kształtów i linii. Kształty i linie są opisane przez algorytmy i są niezależne od rozdzielczości. Dzięki temu obrazy wektorowe są elastyczne i mogą być łatwo skalowane bez utraty jakości. Graﬁka wektorowa jest dobra do tworzenia prostych, precyzyjnych kształtów i linii, takich jak loga czy ikony. Oto kilka głównych różnic między graﬁką rastrową a wektorową:  Struktura: Graﬁka rastrowa składa się z pikseli, natomiast graﬁka wektorowa składa się z kształtów i linii opisanych przez algorytmy.  Skalowalność: Graﬁka rastrowa traci jakość po skalowaniu, natomiast graﬁka wektorowa jest elastyczna i może być skalowana bez utraty jakości.  Zastosowanie: Graﬁka rastrowa jest dobra do przedstawiania szczegółowych obraz ",
  "category": "Kierunkowe"
 },
 {
  "QuestionID": 28,
  "nr": 28,
  "question": "Bloki funkcjonalne komputera",
  "anwer": "Bloki funkcjonalne komputera to poszczególne podzespoły lub układy, które wspólnie tworzą pełniącą swoje zadania jednostkę. Oto niektóre z podstawowych bloków funkcjonalnych komputera:  Procesor (CPU) - serce komputera, odpowiedzialny za przetwarzanie danych.  Pamięć RAM - pamięć, w której przechowywane są dane i programy, które są w danej chwili wykorzystywane przez procesor.  Dysk twardy (HDD) lub dysk SSD - magazyn danych, w którym przechowywane są pliki i programy, nawet po wyłączeniu komputera.  Karta graﬁczna (GPU) - układ odpowiedzialny za przetwarzanie i wyświetlanie obrazu na ekranie.  Złącza rozszerzeń - umożliwiają podłączenie do komputera różnych urządzeń zewnętrznych, takich jak mysz, klawiatura, drukarka itp.  Napęd optyczny - umożliwia odczyt i zapis danych na płytach CD, DVD lub Blu-ray.  Zasilacz - dostarcza prądu do poszczególnych podzespołów komputera.  Obudowa - chroni wszystkie podzespoły komputera i umożliwia ich montaż.",
  "category": "Kierunkowe"
 },
 {
  "QuestionID": 29,
  "nr": 29,
  "question": "Modele cyklu życia systemu informatycznego.",
  "anwer": "Modele cyklu życia systemu informatycznego (ang. software development life cycle, SDLC) to ramy koncepcyjne, które opisują etapy tworzenia i utrzymania systemu informatycznego. Różne modele SDLC różnią się między sobą podejściem do procesu tworzenia systemu, a także zakresem i poziomem szczegółowości poszczególnych etapów. Oto kilka przykładów modeli SDLC: 1. Model linii prostej (ang. waterfall model) - jest to jeden z najstarszych modeli SDLC, w którym etapy tworzenia systemu są realizowane kolejno, bez możliwości powrotu do poprzednich etapów. Każdy etap musi być zakończony zanim rozpocznie się kolejny. 2. Model V (ang. V-model) - jest to ulepszona wersja modelu linii prostej, w której każdy etap tworzenia systemu jest połączony z odpowiednim etapem testowania. Dzięki temu możliwe jest wczesne wykrywanie błędów i ich usuwanie. 3. Model iteracyjny (ang. iterative model) - jest to model, w którym etapy tworzenia systemu są realizowane wielokrotnie, aż do osiągnięcia pożądanego poziomu jakości. Każda iteracja składa się z kilku etapów projektowania, implementacji i testowania. 4. Model spiralny (ang. spiral model) - jest to model, w którym etapy tworzenia systemu są realizowane iteracyjnie, ale każda iteracja jest bardziej szczegółowa niż poprzednia. Model spiralny uwzględnia także ryzyka związane z projektem i opracowuje strategie ich zarządzania. 5.     Model Agile - jest to zbiór metodologii zwinnych, które umożliwiają szybkie reagowanie na zmiany i elastyczne dostosowywanie się do potrzeb klienta. W modelu Agile etapy tworzenia systemu są realizowane iteracyjnie, a klient jest aktywnym uczestnikiem procesu.newLineXD",
  "category": "Kierunkowe"
 },
 {
  "QuestionID": 30,
  "nr": 30,
  "question": "Podstawowe mierniki wzrostu i rozwoju gospodarczego krajów (PKB, PNB, DN)",
  "anwer": "PKB (ang. gross domestic product, PKB) to wskaźnik, który określa wartość wszystkich dóbr i usług ﬁnalnych wyprodukowanych w danym kraju w ciągu roku. PKB jest często używany jako miernik wzrostu i rozwoju gospodarczego kraju. PNB (ang. gross national product, PNB) to wskaźnik, który określa wartość wszystkich dóbr i usług ﬁnalnych wyprodukowanych przez obywateli danego kraju w ciągu roku, niezależnie od tego, gdzie są one produkowane. PNB uwzględnia także dochody zagraniczne i podatki od nich pobierane. DN (ang. GDP per capita, GDP\/capita) to wskaźnik, który określa wartość PKB na jednego mieszkańca danego kraju. Jest to miernik, który pozwala porównać poziom rozwoju gospodarczego różnych krajów. Oprócz PKB, PNB i DN istnieją także inne mierniki wzrostu i rozwoju gospodarczego krajów, takie jak np. indeks rozwoju ludzkiego (Human Development Index, HDI) czy wskaźnik Gini. Każdy z tych mierników ma swoje wady i zalety i może być używany do oceny sytuacji gospodarczej kraju z różnych perspektyw. ",
  "category": "Kierunkowe"
 },
 {
  "QuestionID": 31,
  "nr": 31,
  "question": "Sposoby pomiaru współzależności zjawisk",
  "anwer": "Istnieje wiele sposobów pomiaru współzależności zjawisk, takich jak korelacja, regresja czy analiza skupień. Oto krótki opis każdego z nich: 1. Korelacja - jest to miernik, który określa, czy istnieje związek między dwoma zmiennymi. Może być obliczana na podstawie różnych miar korelacji, takich jak korelacja Pearsona, korelacja Spearmana czy korelacja Kendalla. Im wyższa wartość korelacji, tym silniejszy związek między zmiennymi. 2. Regresja - jest to metoda statystyczna, która pozwala na przewidzenie wartości jednej zmiennej na podstawie wartości innej zmiennej. Można ją stosować, gdy istnieje liniowa zależność między zmiennymi. 3. Analiza skupień - jest to metoda statystyczna, która pozwala na grupowanie obiektów (np. ludzi, ﬁrm) według podobieństwa ich cech. Można ją stosować, gdy chcemy znaleźć podobne do siebie grupy zjawisk lub zidentyﬁkować różnice między nimi. Inne sposoby pomiaru współzależności zjawisk to m.in. analiza korespondencji, analiza wariancji, analiza skojarzeń. Każdy z nich ma swoje zastosowanie w zależności od rodzaju danych i celu badania. ",
  "category": "Kierunkowe"
 },
 {
  "QuestionID": 32,
  "nr": 32,
  "question": "Role serwerów w sieciach typu klient - serwer",
  "anwer": "Oto kilka przykładów ról, jakie mogą pełnić serwery w sieciach typu klient-serwer: 1.     Serwer plików - służy do udostępniania plików i folderów użytkownikom sieci. Może być wykorzystywany do przechowywania dokumentów, obrazów, ﬁlmów itp.newLineXD2.     Serwer baz danych - służy do przechowywania i zarządzania danymi, takimi jak np. informacje o klientach, produktach czy zamówieniach. Może być wykorzystywany przez aplikacje klienckie do odczytu lub zapisu danych.newLineXD3.     Serwer WWW - służy do udostępniania zasobów sieciowych, takich jak strony internetowe, obrazki czy pliki multimedialne. Użytkownicy mogą uzyskać dostęp do tych zasobów poprzez przeglądarkę internetową.newLineXD4.     Serwer poczty elektronicznej - służy do przesyłania i odbierania wiadomości elektronicznych. Może być wykorzystywany zarówno przez aplikacje klienckie, jak i przez przeglądarkę internetową.newLineXD5.     Serwer aplikacji - służy do udostępniania aplikacji klientom sieci. Użytkownicy mogą korzystać z aplikacji zdalnie, za pośrednictwem klienta aplikacji lub przeglądarki internetowej.newLineXDSerwery w sieciach typu klient-serwer pełnią ważną rolę w zapewnieniu sprawnego funkcjonowania sieci oraz udostępniania różnego rodzaju zasobów i usług użytkownikom.newLineXDnewLineXD",
  "category": "Kierunkowe"
 },
 {
  "QuestionID": 33,
  "nr": 33,
  "question": "Metody badań operacyjnych jako narzędzia wspierające analizy decyzyjne ",
  "anwer": "Metody badań operacyjnych (ang. operations research, OR) to dziedzina nauki, która zajmuje się rozwiązywaniem problemów decyzyjnych za pomocą narzędzi matematycznych i informatycznych. Metody te są szczególnie przydatne w sytuacjach, gdy problem decyzyjny jest złożony i wymaga rozważenia wielu czynników oraz ograniczeń.newLineXDMetody badań operacyjnych mogą być wykorzystywane jako narzędzia wspierające analizy decyzyjne w różnych dziedzinach, takich jak np. zarządzanie, ﬁnanse, logistyka, marketing itp. Oto kilka przykładów zastosowań metod badań operacyjnych w analizach decyzyjnych:newLineXD1. Modelowanie matematyczne - pozwala na opisanie problemu decyzyjnego w formie matematycznej, co umożliwia wyznaczenie optymalnych rozwiązań za pomocą algorytmów matematycznych.newLineXD2. Programowanie liniowe - umożliwia znajdowanie optymalnych rozwiązań problemów decyzyjnych, które obejmują ograniczenia liniowe.newLineXD3. Symulacja komputerowa - pozwala na symulowanie różnych scenariuszy i wyliczenie ich skutków na podstawie danych historycznych lub szacunków.newLineXD4. Analiza decyzji - umożliwia ocenę ryzyka i wartości opcji decyzyjnych za pomocą narzędzi matematycznych i statystycznych.newLineXDMetody badań operacyjnych stanowią cenne narzędzie wspierające proces podejmowania decyzji w różnych sytuacjach, zarówno w biznesie, jak i w innych dziedzinach.newLineXDnewLineXDPojęcie,",
  "category": "Kierunkowe"
 },
 {
  "QuestionID": 34,
  "nr": 34,
  "question": "metody pomiaru, przyczyny, rodzaje i ekonomiczne skutki bezrobocia",
  "anwer": "Bezrobocie to stan, w którym osoby aktywne zawodowo nie są zatrudnione, ale są gotowe do podjęcia pracy i szukają zatrudnienia. Bezrobocie może być mierzone na różne sposoby, a jednym z najczęściej stosowanych jest stopa bezrobocia, która określa procent osób bez pracy w stosunku do całej ludności w wieku produkcyjnym. Istnieje wiele przyczyn bezrobocia, takich jak np. kryzysy gospodarcze, zmiany technologiczne, zmiany w strukturze rynku pracy, brak odpowiednich kwaliﬁkacji czy bariery geograﬁczne. Bezrobocie może być także skutkiem indywidualnych decyzji, takich   jak np. rezygnacja z pracy w celu podjęcia nauki lub opieki nad dziećmi.newLineXDIstnieją różne rodzaje bezrobocia, takie jak bezrobocie strukturalne, sezonowe, technologiczne czy cykliczne. Bezrobocie strukturalne wynika z dysproporcji między poszukiwanymi kwaliﬁkacjami a dostępnymi ofertami pracy. Bezrobocie sezonowe dotyczy branż, w których sezonowość ma wpływ na poziom zatrudnienia, np. turystyka czy rolnictwo. Bezrobocie technologiczne wynika z wprowadzenia nowych technologii, które zastępują ludzi w procesie produkcji.newLineXDnewLineXD",
  "category": "Kierunkowe"
 },
 {
  "QuestionID": 35,
  "nr": 35,
  "question": "Cechy charakterystyczne współczesnych kryzysów finansowych i ekonomicznych",
  "anwer": "Współczesne kryzysy ﬁnansowe i ekonomiczne charakteryzują się kilkoma cechami, które odróżniają je od kryzysów sprzed lat. Oto niektóre z nich:newLineXD1. Szybkość rozprzestrzeniania się - kryzysy ﬁnansowe są coraz bardziej globalne i szybko rozprzestrzeniają się na inne rynki i sektory gospodarki.newLineXD2. Złożoność - współczesne kryzysy ﬁnansowe są zazwyczaj bardzo złożone i mogą mieć różne przyczyny, takie jak np. brak regulacji rynkowych, nadmierne zadłużenie, brak transparentności czy brak odpowiedzialności instytucji ﬁnansowych.newLineXD3. Globalne skutki - kryzysy ﬁnansowe i ekonomiczne mogą mieć bardzo szerokie skutki, dotykając nie tylko sektora ﬁnansowego, ale także innych sektorów gospodarki, takich jak np. przemysł czy usługi.newLineXD4. Trudności w rozwiązaniu - kryzysy ﬁnansowe są trudne do rozwiązania, ponieważ wymagają skoordynowanej reakcji różnych podmiotów (rządów, instytucji ﬁnansowych, ﬁrm itp.) i często wymagają podjęcia trudnych decyzji.newLineXD5. Częstotliwość występowania - kryzysy ﬁnansowe i ekonomiczne występują coraz częściej, co wynika m.in. z globalizacji rynków i coraz większej złożoności mechanizmów rynkowych.newLineXD",
  "category": "Kierunkowe"
 },
 {
  "QuestionID": 36,
  "nr": 1,
  "question": "Proszę omówić pojęcie gry i zabawy w naukach społecznych",
  "anwer": "W naukach społecznych pojęcie gry i zabawy odnosi się do różnych form interakcji między ludźmi, które mają charakter celowy, ale nie są związane z codziennymi obowiązkami i obciążeniami. Gry i zabawy mogą mieć różne formy i mogą być realizowane w różnych miejscach, takich jak np. szkoła, praca, dom czy park.newLineXDGry i zabawy pełnią ważną rolę w życiu społecznym i kulturze. Służą m.in. do nawiązywania relacji między ludźmi, do rozwijania umiejętności społecznych i komunikacyjnych, a także do zapewnienia rozrywki i odpoczynku.newLineXDW naukach społecznych pojęcie gry i zabawy jest również często używane jako metafora do opisywania różnych form interakcji i działań społecznych, takich jak np. polityka czy biznes. W ten sposób gry i zabawy stają się narzędziem do analizy i zrozumienia różnych mechanizmów i procesów społecznych.newLineXDnewLineXD",
  "category": "Specjalizacja"
 },
 {
  "QuestionID": 37,
  "nr": 2,
  "question": "Proszę omówić rozwój technologiczny gier",
  "anwer": "Rozwój technologiczny gier rozpoczął się w latach 50. i 60. XX wieku, kiedy pojawiły się pierwsze komputery osobiste i konsole do gier. W ciągu ostatnich kilku dekad technologia gier znacząco się rozwinęła i obecnie mamy do czynienia z bardzo zaawansowanymi i złożonymi produktami.newLineXDJednym z kluczowych elementów rozwoju technologicznego gier była ewolucja oprogramowania. W miarę jak komputery stawały się coraz potężniejsze, twórcy gier mogli tworzyć coraz bardziej złożone i realistyczne światy. Oprócz tego pojawiły się także nowe rodzaje oprogramowania, takie jak np. enginy, które umożliwiają szybsze i łatwiejsze tworzenie gier. Innym ważnym elementem rozwoju technologicznego gier była ewolucja sprzętu do gier. Konsole do gier stały się coraz potężniejsze, a pojawienie się urządzeń takich jak smartfony i tablety umożliwiło grę na urządzeniach mobilnych. W ostatnich latach pojawiły się także nowe technologie, takie jak np. wirtualna rzeczywistość, które otwierają nowe możliwości rozgrywki.newLineXDRozwój technologiczny gier ma również wpływ na sposób, w jaki gry są tworzone i dystrybuowane. W dobie internetu coraz więcej gier jest dostępnych w formie cyfrowej, co umożliwia szybki i łatwy dostęp do gier z całego świata.newLineXDnewLineXD",
  "category": "Specjalizacja"
 },
 {
  "QuestionID": 38,
  "nr": 3,
  "question": "Proszę omówić rozwój gatunkowy gier",
  "anwer": "Gatunki gier są to rodzaje gier, które różnią się między sobą pod względem mechanik rozgrywki, sposobu prezentacji, tematyki czy celu gry.newLineXDRozwój gatunkowy gier rozpoczął się wraz z pojawieniem się pierwszych komputerów osobistych i konsol do gier. W ciągu ostatnich kilku dekad pojawiły się różne nowe gatunki gier, a istniejące gatunki ewoluowały i rozwijały się.newLineXDJednymi z pierwszych gatunków gier były gry zręcznościowe, takie jak np. Space Invaders czy Pac-Man, oraz gry fabularne, takie jak np. Zork. W kolejnych latach pojawiły się nowe gatunki, takie jak np. gry strategiczne, taktyczne, RPG (gry fabularne z elementami rozgrywki fabularnej), FPS (gry strzelanki pierwszoosobowe) czy MMO (gry sieciowe z rozgrywką dla wielu graczy).newLineXDObecnie istnieje wiele różnych gatunków gier, a granice między nimi są coraz mniej wyraźne. Wiele gier łączy elementy kilku różnych gatunków, tworząc nowe, hybrydowe formy rozgrywki.newLineXDnewLineXD",
  "category": "Specjalizacja"
 },
 {
  "QuestionID": 39,
  "nr": 4,
  "question": "Proszę omówić ekonomiczne znaczenie gier",
  "anwer": "Ekonomiczne znaczenie gier jest bardzo ważne i rośnie wraz ze wzrostem popularności gier. Gry są obecnie jednym z najważniejszych sektorów przemysłu rozrywkowego, a ich przychody sięgają miliardów dolarów rocznie.newLineXDGry stanowią ważny element gospodarki i przyczyniają się do tworzenia miejsc pracy, zarówno w branży gier, jak i poza nią. Twórcy gier zatrudniają programistów, graﬁków, muzyków, aktorów i innych specjalistów, a także korzystają z usług ﬁrm zewnętrznych, takich jak np. studia reklamowe czy agencje PR.newLineXDGry są również ważnym elementem gospodarki cyfrowej i stanowią ważne źródło dochodów dla platform cyfrowych, takich jak np. App Store czy Steam. Gry są również ważnym elementem ekosystemu internetowych reklam, ponieważ umożliwiają reklamodawcom dotarcie do szerokiej i zróżnicowanej grupy odbiorców.newLineXDGry są również ważnym elementem kultury i rozrywki. Służą do nawiązywania relacji między ludźmi, do rozwijania umiejętności społecznych i komunikacyjnych oraz do zapewnienia rozrywki i odpoczynku. W ten sposób gry przyczyniają się do poprawy jakości życia i dobrobytu społecznego.newLineXDnewLineXD",
  "category": "Specjalizacja"
 },
 {
  "QuestionID": 40,
  "nr": 5,
  "question": "Sposoby wykorzystania gier w edukacji, nauce",
  "anwer": "Gry są coraz częściej wykorzystywane w nauce i badaniach naukowych, ponieważ umożliwiają one symulację zjawisk czynewLineXDprocesów, co pozwala na ich lepsze zrozumienie i analizę. Oto kilka przykładów sposobów wykorzystania gier w nauce: 1. Symulacje zjawisk i procesów: Gry mogą być wykorzystywane do symulacji zjawisk czy procesów, takich jak np. ruchy planet czy zachowanie się grup ludzi w sytuacjach kryzysowych. Symulacje te pozwalają na lepsze zrozumienie tych zjawisk i procesów oraz na przeprowadzanie hipotetycznych eksperymentów.newLineXD2. Testowanie hipotez: Gry mogą być wykorzystywane do testowania hipotez naukowych, np. dotyczących zachowania się ludzi w różnych sytuacjach czy skutków określonych działań.newLineXD3. Nauka przez zabawę: Gry mogą być wykorzystywane jako narzędzie do nauki poprzez zabawę, np. do nauki języków obcych czy przedmiotów szkolnych.newLineXD4. Badanie zachowań graczy: Gry mogą być wykorzystywane do badania zachowań graczy, np. do analizy sposobów podejmowania decyzji czy komunikacji między graczami.newLineXD5. Edukacja medyczna: Gry mogą być wykorzystywane w edukacji medycznej, np. do symulacji zabiegów czy do nauki obsługi sprzętu medycznego.newLineXDnewLineXD",
  "category": "Specjalizacja"
 },
 {
  "QuestionID": 41,
  "nr": 6,
  "question": "Proszę wymienić kluczowe koncepcje związane z narracja i opowiadaniem historii",
  "anwer": "Narracja i opowiadanie historii to ważne koncepcje w wielu dziedzinach, w tym w literaturze, ﬁlmie, grach komputerowych czy reklamie. Oto kilka kluczowych koncepcji związanych z narracją i opowiadaniem historii:newLineXD Fabuła: Fabuła to struktura opowiadanej historii, która obejmuje wydarzenia, postaci i ich motywacje oraz sposób, w jaki te elementy są ze sobą powiązane.newLineXD Perspektywa narracyjna: Perspektywa narracyjna określa sposób, w jaki historia jest opowiadana, tj. z punktu widzenia określonej postaci czy z perspektywy obserwatora zewnętrznego.newLineXD Punkt widzenia: Punkt widzenia to perspektywa, z której opowiadana jest historia, tj. punkt widzenia określonej postaci lub grupy postaci.newLineXD Struktura narracji: Struktura narracji to sposób, w jaki historia jest opowiadana, tj. sekwencja wydarzeń, sposób ich ujęcia oraz relacje między nimi.newLineXD Kompozycja narracji: Kompozycja narracji to sposób, w jaki elementy fabuły i struktury narracji są ze sobą połączone i tworzą spójną całość.newLineXD Sposób opowiadania: Sposób opowiadania to styl, w jaki historia jest przedstawiona, tj. sposób użycia języka, emocji czy szczegółów.newLineXD Punkt zwrotny: Punkt zwrotny to moment w opowiadanej historii, w którym następuje zmiana kierunku lub istotny przełom.newLineXDnewLineXD",
  "category": "Specjalizacja"
 },
 {
  "QuestionID": 42,
  "nr": 7,
  "question": "Proszę omówić fabuły liniowe",
  "anwer": "Fabuła liniowa to rodzaj struktury opowiadanej historii, w której wydarzenia są opowiadane w kolejności chronologicznej. W takiej fabule wszystkie wydarzenia są ze sobą ściśle powiązane i tworzą spójną całość. Fabuła liniowa jest często stosowana w różnych formach narracji, takich jak literatura, ﬁlm czy gry komputerowe.newLineXDPrzykłady fabuł liniowych to np. opowieści o poszukiwaniu skarbu, odkrywaniu tajemnicy czy przeżywaniu przygód. W takich opowieściach wydarzenia są opowiadane kolejno, od początku do końca, co pozwala na lepsze zrozumienie historii i jej sensu.newLineXDFabuły liniowe są często wykorzystywane w grach komputerowych, ponieważ umożliwiają one lepsze zaprezentowanie historii i zapewniają spójność całej rozgrywki.newLineXDJedną z głównych zalet fabuł liniowych jest ich prostota i łatwość zrozumienia przez odbiorcę. W przeciwieństwie do fabuł nieliniowych, w których wydarzenia są opowiadane w różnych kolejnościach, fabuły liniowe są łatwiejsze do zrozumienia i pozwalają na lepsze zapamiętanie historii.newLineXDnewLineXD",
  "category": "Specjalizacja"
 },
 {
  "QuestionID": 43,
  "nr": 8,
  "question": "FProszę omówić fabuły nieliniowe",
  "anwer": "Fabuła nieliniowa to rodzaj struktury opowiadanej historii, w której wydarzenia są opowiadane w niekoniecznej kolejności chronologicznej. W takiej fabule wydarzenia mogą być opowiadane w różnych porządkach lub mogą być pomieszane z innymi wydarzeniami, co tworzy bardziej skomplikowaną i nieliniową historię.newLineXDFabuły nieliniowe są często stosowane w literaturze, ﬁlmie czy grach komputerowych. Przykłady fabuł nieliniowych to np. opowieści o zagadkach, tajemnicach czy historie z przeszłości, które są opowiadane w różnych porządkach lub są pomieszane z wydarzeniami z innych okresów czasu.newLineXDFabuły nieliniowe są często wykorzystywane w grach komputerowych, ponieważ pozwalają one na bardziej złożone i interesujące historie oraz umożliwiają graczowi większą swobodę wyboru.newLineXDJedną z głównych zalet fabuł nieliniowych jest ich różnorodność i możliwość tworzenia bardziej skomplikowanych i interesujących historii. W przeciwieństwie do fabuł liniowych, które są łatwiejsze do zrozumienia, fabuły nieliniowe mogą być bardziej skomplikowane i wymagać większego zaangażowania od odbiorcy.newLineXDnewLineXD",
  "category": "Specjalizacja"
 },
 {
  "QuestionID": 44,
  "nr": 9,
  "question": "Proszę wymienić omówić  oprogramowanie do projektowania 3D",
  "anwer": "Oprogramowanie do projektowania 3D to narzędzia, które służą do tworzenia trójwymiarowych modeli i animacji. Są one często wykorzystywane w różnych dziedzinach, takich jak graﬁka komputerowa, architektura, inżynieria czy gry komputerowe.newLineXDNiektóre przykłady oprogramowania do projektowania 3D to:newLineXD Autodesk 3ds Max - profesjonalne narzędzie do tworzenia animacji i modeli 3D. Zawiera szerokie możliwości edycji i tworzenia efektów specjalnych oraz integrację z innymi narzędziami Autodesk.newLineXD Blender - darmowe oprogramowanie o otwartym kodzie źródłowym do tworzenia modeli 3D, animacji i ﬁlmów. Zawiera szerokie możliwości edycji i tworzenia efektów specjalnych oraz szeroki zakres narzędzi do modelowania i animacji.newLineXD Cinema 4D - profesjonalne narzędzie do tworzenia animacji i modeli 3D. Zawiera szerokie możliwości edycji i tworzenia efektów specjalnych oraz integrację z innymi narzędziami ﬁrmy Maxon.newLineXD SketchUp - prosta w obsłudze aplikacja do tworzenia modeli 3D. Służy głównie do tworzenia prostych modeli architektonicznych i wnętrz.newLineXD ZBrush - narzędzie do tworzenia szczegółowych modeli 3D z wysokim poziomem szczegółowości. Zawiera szerokie możliwości edycji i tworzenia efektów specjalnych oraz szeroki zakres narzędzi do modelowania i animacji.newLineXDnewLineXD",
  "category": "Specjalizacja"
 },
 {
  "QuestionID": 45,
  "nr": 10,
  "question": "Tworzenie animacji dla stron WWW",
  "anwer": "Tworzenie animacji dla stron WWW to proces tworzenia dynamicznych elementów na stronach internetowych, które mogą być wyświetlane w przeglądarkach internetowych. Animacje mogą być tworzone za pomocą różnych technik, takich jak CSS, JavaScript, HTML5 czy Flash.newLineXDTworzenie animacji dla stron WWW wymaga znajomości podstawowych zasad tworzenia animacji oraz zastosowania odpowiednich narzędzi i technik. Najczęściej używanymi narzędziami do tworzenia animacji są programy graﬁczne, takie jak Adobe Photoshop czy Adobe Illustrator, a także specjalistyczne narzędzia do tworzenia animacji, takie jak Adobe After Effects czy Blender.newLineXDTworzenie animacji dla stron WWW polega na przygotowaniu odpowiednich graﬁk i sekwencji animacji, a następnie ich zamieszczenie na stronie internetowej za pomocą odpowiednich technik. Możliwe jest również zastosowanie gotowych narzędzi do tworzenia animacji, takich jak kreatory animacji dostępne w internecie.newLineXD",
  "category": "Specjalizacja"
 },
 {
  "QuestionID": 46,
  "nr": 11,
  "question": "Grafika rastrowa – charakterystyka, wady i zalety, przykłady użycia",
  "anwer": "Graﬁka rastrowa (bitmapowa) to rodzaj graﬁki, w której obraz jest reprezentowany przez siatkę komórek (pikseli), a każdy z nich ma przypisany kolor. W zależności od ilości pikseli, które tworzą obraz, rozróżnia się graﬁkę rastrową o wysokiej i niskiej rozdzielczości. Graﬁka rastrowa o wysokiej rozdzielczości jest bardziej szczegółowa i ma lepszą jakość, ale też zajmuje więcej miejsca na dysku.newLineXDGraﬁka rastrowa ma wiele zastosowań w różnych dziedzinach. Jest często używana do tworzenia zdjęć, obrazów ogólnego przeznaczenia oraz obrazów zawierających dużo szczegółów. Może być również używana do tworzenia animacji, choć jest to trudniejsze niż w przypadku graﬁki wektorowej.newLineXDGraﬁka rastrowa ma również pewne wady. Przede wszystkim, ze względu na dużą liczbę pikseli, obraz zajmuje dużo miejsca na dysku i może być ciężki do przesłania przez internet. Ponadto, ze względu na to, że obraz jest reprezentowany przez piksele, trudno jest go powiększać bez utraty jakości. Gdy obraz jest powiększany, piksele są rozciągane, co prowadzi do pogorszenia jakości obrazu.newLineXDPrzykłady użycia graﬁki rastrowej to:newLineXD ZdjęcianewLineXD Obrazy ogólnego przeznaczenia (np. plakaty, reklamy)newLineXD MapynewLineXD  IkonynewLineXD  EmblematynewLineXD Animacje (choć rzadziej niż w przypadku graﬁki wektorowej)newLineXDnewLineXD",
  "category": "Specjalizacja"
 },
 {
  "QuestionID": 47,
  "nr": 12,
  "question": "Grafika wektorowa – charakterystyka, wady i zalety, przykłady użycia",
  "anwer": "Graﬁka wektorowa to rodzaj graﬁki, w której obraz jest reprezentowany przez różnego rodzaju kształty i ﬁgury geometryczne, takie jak linie, okręgi, elipsy, trójkąty itp. Każdy z tych kształtów jest opisany przez matematyczne wzory, dzięki czemu obraz jest reprezentowany przez wektory (ciągi liczb opisujących położenie punktów).newLineXDGraﬁka wektorowa ma wiele zalet w stosunku do graﬁki rastrowej. Przede wszystkim, ze względu na brak pikseli, obraz zajmuje znacznie mniej miejsca na dysku i jest łatwiejszy do przesłania przez internet. Ponadto, ze względu na to, że obraz jest opisany przez wzory, można go łatwo skalować bez utraty jakości. W przeciwieństwie do graﬁki rastrowej, graﬁka wektorowa nie traci jakości podczas powiększania, ponieważ kształty są opisywane przez wzory, a nie przez poszczególne piksele.newLineXDGraﬁka wektorowa ma również pewne wady. Przede wszystkim, jest mniej szczegółowa niż graﬁka rastrowa i nie nadaje się do prezentowania obrazów o dużej liczbie szczegółów. Ponadto, graﬁka wektorowa nie jest dobrym rozwiązaniem do tworzenia animacji, ponieważ wymaga dużo więcej obliczeń niż graﬁka rastrowa.newLineXDPrzykłady użycia graﬁki wektorowej to:newLineXD IkonynewLineXD LoganewLineXD DiagramynewLineXD Wizualizacje danychnewLineXD  Projekty graﬁczne (np. plakaty, ulotki)newLineXD MapynewLineXD  Animacje (choć rzadziej niż w przypadku graﬁki rastrowej)newLineXDnewLineXD",
  "category": "Specjalizacja"
 },
 {
  "QuestionID": 48,
  "nr": 13,
  "question": "Metody montażu muzyki na potrzeby gier",
  "anwer": "Montaż muzyki na potrzeby gier to proces tworzenia oprawy muzycznej do gry komputerowej lub konsolowej. Istnieje kilka różnych metod montażu muzyki, które mogą być używane w zależności od potrzeb danej gry. Oto kilka przykładów:newLineXD1. Montaż pod konkretne wydarzenia w grze: Muzyka jest dostosowywana do konkretnych wydarzeń w grze, takich jak walka z bossami, skoki na platformach itp. Może być to realizowane poprzez dodawanie odpowiednich fragmentów muzyki lub przez zmianę parametrów muzyki (np. tempo, nastrój).newLineXD2. Montaż dynamiczny: Muzyka jest dostosowywana do tego, co dzieje się w grze w czasie rzeczywistym. Na przykład, gdy gracz porusza się w wolnym tempie, muzyka może być spokojna i nastrojowa, a gdy gracz zaczyna walczyć, muzyka może się przyspieszyć i stać się bardziej ekscytująca.newLineXD3. Montaż z użyciem specjalnych efektów: Muzyka może być wzbogacona o specjalne efekty dźwiękowe, takie jak odgłosy walki, wybuchy itp., które są dostosowywane do akcji w grze.newLineXD4. Montaż z użyciem muzyki oryginalnej: Muzyka oryginalna jest tworzona specjalnie dla danej gry i jest nierozerwalnie związana z nią. Może być ona używana jako oprawa muzyczna całej gry lub w określonych momentach.newLineXDnewLineXD",
  "category": "Specjalizacja"
 },
 {
  "QuestionID": 49,
  "nr": 14,
  "question": "Działanie i ograniczenia urządzeń mobilnych ",
  "anwer": "Urządzenia mobilne to urządzenia elektroniczne, które można swobodnie przenosić i korzystać z nich w różnych miejscach. Do najpopularniejszych urządzeń mobilnych należą smartfony, tablety, komputery przenośne (laptopy) i konsole do gier.newLineXDDziałanie urządzeń mobilnych jest uzależnione od ich rodzaju i specyﬁkacji technicznej. Ogólnie rzecz biorąc, urządzenia mobilne są wyposażone w procesor, pamięć RAM, dysk twardy lub pamięć wewnętrzną oraz wyświetlacz. Są one zasilane przez baterie lub akumulatory, które umożliwiają korzystanie z urządzenia przez pewien czas po odłączeniu go od zasilania sieciowego.newLineXDOgraniczenia urządzeń mobilnych zależą od ich specyﬁkacji technicznej i rodzaju zastosowania. Na przykład, smartfony i tablety są ograniczone przez pojemność baterii, co oznacza, że po pewnym czasie korzystania z urządzenia trzeba je ładować. Innym ograniczeniem może być pojemność dysku twardego lub pamięci wewnętrznej, co oznacza, że na urządzeniu nie można zapisać zbyt dużej ilości danych.newLineXDPonadto, urządzenia mobilne są ograniczone przez rodzaj i szybkość łącza internetowego, co wpływa na to, jak szybko można pobierać dane lub korzystać z aplikacji internetowych.newLineXDnewLineXD",
  "category": "Specjalizacja"
 },
 {
  "QuestionID": 50,
  "nr": 15,
  "question": "Specyfika programowania urządzeń mobilnych oraz modele dystrybucji oprogramowania",
  "anwer": "Programowanie urządzeń mobilnych to proces tworzenia oprogramowania (aplikacji) dedykowanego dla urządzeń mobilnych, takich jak smartfony, tablety czy konsole do gier. W przypadku programowania urządzeń mobilnych, istotne jest zrozumienie specyﬁki tych urządzeń oraz ograniczeń, z jakimi się je ma do czynienia.newLineXDJednym z głównych ograniczeń jest ograniczona moc obliczeniowa urządzeń mobilnych w porównaniu do komputerów stacjonarnych. Oznacza to, że aplikacje mobilne muszą być zoptymalizowane pod kątem wydajności, aby działały płynnie i nie obciążały zbytnio urządzenia.newLineXDKolejnym ważnym aspektem jest interfejs użytkownika (UI) oraz doświadczenie użytkownika (UX). W przypadku urządzeń mobilnych, interfejs musi być przyjazny dla użytkownika i umożliwiać swobodne korzystanie z aplikacji za pomocą dotyku.newLineXDModel dystrybucji oprogramowania dla urządzeń mobilnych zazwyczaj opiera się na sklepach internetowych, takich jak App Store dla systemu iOS czy Google Play dla systemu Android. Dzięki temu użytkownicy mogą łatwo znaleźć i pobrać aplikacje, a deweloperzy mogą łatwo dystrybuować swoje oprogramowanie. Inne modele dystrybucji oprogramowania dla urządzeń mobilnych to na przykład dystrybucja bezpośrednio przez deweloperów lub przez ﬁrmowe sklepy aplikacji.newLineXDnewLineXD",
  "category": "Specjalizacja"
 },
 {
  "QuestionID": 51,
  "nr": 16,
  "question": "Proces tworzenia aplikacji w Unity",
  "anwer": "Unity to platforma do tworzenia gier i aplikacji interaktywnych, która umożliwia tworzenie aplikacji zarówno dla komputerów, jak i urządzeń mobilnych. Oto ogólny proces tworzenia aplikacji w Unity:newLineXD Utworzenie nowego projektu: na początek należy utworzyć nowy projekt w Unity i określić jego nazwę, lokalizację i ustawienia.newLineXD Modelowanie i tworzenie tekstur: następnie należy zająć się modelowaniem obiektów 3D oraz tworzeniem tekstur, które będą użyte w grze lub aplikacji. Można to zrobić za pomocą specjalistycznych narzędzi do modelowania 3D, takich jak Blender czy 3ds Max.newLineXD Importowanie zasobów: po stworzeniu modeli i tekstur należy je zaimportować do Unity. W tym celu należy skorzystać z narzędzia \"Import\" w panelu \"Project\".newLineXD Tworzenie sceny: następnie należy zająć się tworzeniem sceny gry lub aplikacji. W tym celu należy ustawić obiekty 3D na odpowiednich pozycjach oraz dodać światła i efekty specjalne.newLineXD Skryptowanie: kolejnym krokiem jest dodanie funkcjonalności do aplikacji za pomocą skryptów napisanych w języku C# lub UnityScript. Skrypty pozwalają na zdeﬁniowanie zachowań obiektów w grze lub aplikacji oraz na obsługę zdarzeń i interakcji użytkownika.newLineXD Testowanie i debugowanienewLineXDnewLineXD",
  "category": "Specjalizacja"
 },
 {
  "QuestionID": 52,
  "nr": 17,
  "question": "Typy danych, zmienne , funkcje .w Unity",
  "anwer": "Unity to platforma do tworzenia gier i aplikacji interaktywnych, która używa języka C# do skryptowania zachowań obiektów i obsługi zdarzeń. W Unity istnieje kilka podstawowych typów danych, takich jak:newLineXD int (całkowita): służy do przechowywania liczb całkowitych, np. 1, 2, 3 itp.newLineXD ﬂoat (zmiennoprzecinkowa): służy do przechowywania liczb zmiennoprzecinkowych, np. 1.5, 2.3, 3.14 itp.newLineXD bool (logiczna): służy do przechowywania wartości logicznych true (prawda) lub false (fałsz).newLineXD string (ciąg znaków): służy do przechowywania ciągów znaków, np. \"Hello World!\".newLineXDZmienne są to pojemniki do przechowywania danych w pamięci komputera. Aby utworzyć zmienną w Unity, należy określić jej typ, nazwę i przypisać jej wartość początkową.newLineXDFunkcje to fragmenty kodu, które służą do wykonywania określonych zadań. Aby utworzyć funkcję w Unity, należy zdeﬁniować jej nazwę, typ zwracanej wartości (jeśli taka jest) oraz listę argumentów (jeśli taka jest)newLineXDnewLineXD",
  "category": "Specjalizacja"
 },
 {
  "QuestionID": 53,
  "nr": 18,
  "question": "Tworzenie klas i obiektów w c#",
  "anwer": "Klasy są to szablony do tworzenia obiektów, które zawierają informacje o tym, jakie dane i funkcje powinny być dostępne w obiekcie. Aby utworzyć klasę w C#, należy użyć słowa kluczowego \"class\" i zdeﬁniować nazwę klasy. Można również dodać pola (zmienne), które będą przechowywać dane oraz metody (funkcje), które będą wykonywać określone zadania. Przykład:newLineXDclass Osoba { public string Imię; public string Nazwisko; public int Wiek; public stringPrzedstawSie() { return \"Cześć, nazywam się \" + Imię + \" \" + Nazwisko + \" i mam \"newLineXD+ Wiek + \" lat.\"; } }newLineXDObiekty są to konkretne egzemplarze klas, które zawierają konkretne dane i funkcje. Aby utworzyć obiekt w C#, należy utworzyć nowy egzemplarz klasy za pomocą operatora new i przypisać go do zmiennej. Następnie można użyć operatora ., aby uzyskać dostęp do pól i metod obiektu. Przykład:newLineXDOsoba osoba1 = new Osoba(); osoba1.Imię = \"Anna\"; osoba1.Nazwisko = \"Kowalska\"; osoba1.Wiek = 25; string przedstawienie = osoba1.PrzedstawSie(); Debug.Log(przedstawienie); \/\/ wyświetli \"Cześć, nazywam się Anna Kowalska i mam 25 lat.\"",
  "category": "Specjalizacja"
 },
 {
  "QuestionID": 54,
  "nr": 19,
  "question": "Zasady projektowania aplikacji na terminale mobilne przy wykorzystaniu programowania sieciowego",
  "anwer": "Oto kilka zasad projektowania aplikacji na terminale mobilne przy wykorzystaniu programowania sieciowego:newLineXD Zoptymalizuj zużycie danych: Aplikacje mobilne często korzystają z połączenia sieciowego, więc ważne jest, aby minimalizować ilość danych przesyłanych i odbieranych przez aplikację. Można to osiągnąć przez optymalizację rozmiaru plików, kompresję danych i unikanie niepotrzebnych zapytań do serwera.newLineXD Używaj asynchronicznych metod do łączenia się z serwerem: Łączenie się z serwerem za pomocą synchronicznych metod może spowolnić aplikację lub spowodować jej zamrożenie. Dlatego warto używać asynchronicznych metod, które pozwalają aplikacji na wykonywanie innych zadań podczas oczekiwania na odpowiedź z serwera.newLineXD Zoptymalizuj wydajność aplikacji: Aplikacje mobilne mogą działać na urządzeniach o różnych mocach obliczeniowych, więc ważne jest, aby zoptymalizować wydajność aplikacji, aby działała ona płynnie na różnych urządzeniach. Można to osiągnąć przez optymalizację kodu, unikanie niepotrzebnych operacji i używanie wydajnych algorytmów.newLineXD Zabezpiecz dane: Przesyłanie danych przez sieć może być narażone na różne rodzaje ataków, dlatego ważne jest, aby zabezpieczyć dane przed nieautoryzowanym dostępem. Można to zrobić przez szyfrowanie danych przy użyciu bezpiecznych algorytmów lub przez używanie protokołów bezpieczeństwa, takich jak HTTPS.newLineXDnewLineXD",
  "category": "Specjalizacja"
 },
 {
  "QuestionID": 55,
  "nr": 20,
  "question": "Proszę podać modele barw wykorzystywane w popularnych programach do tworzenia grafiki 3D i animacji.",
  "anwer": "W popularnych programach do tworzenia graﬁki 3D i animacji wykorzystywane są następujące modele barw:newLineXD RGB (Red, Green, Blue) - model barw oparty na trzech podstawowych barwach: czerwonym, zielonym i niebieskim. Każda z tych barw jest reprezentowana przez osobny kanał składowy (R, G, B), a ich mieszanie pozwala uzyskać dowolny kolor.newLineXD CMYK (Cyan, Magenta, Yellow, Key) - model barw oparty na czterech podstawowych barwach: cyan (błękitny), magenta (pomarańczowy), żółty i key (czarny). Ten model jest szczególnie popularny w drukarce, ponieważ pozwala uzyskać bardzo dobrą jakość druku.newLineXD HSL (Hue, Saturation, Lightness) - model barw oparty na trzech parametrach: odcieniu (hue), nasyceniu (saturation) i jasności (lightness). Ten model umożliwia łatwe zmiany odcienia, nasycenia i jasności koloru bez zmiany jego charakteru.newLineXD LAB (Lightness, a, b) - model barw oparty na trzech parametrach: jasności (lightness), barwie a (odcieniu) i barwie b (nasyceniu). Ten model jest szczególnie przydatny do dokładnego reprezentowania kolorów widzialnego spektrum, ponieważ uwzględnia percepcję ludzkiego oka.newLineXD XYZ (X, Y, Z) - model barw oparty na trzech parametrach: X, Y i Z. Ten model jest oparty na modelu RGB, ale uwzględnia również jasność i nasycenie kolorów. Jest często używany w systemach oświetleniowych i drukarskich.newLineXDnewLineXD",
  "category": "Specjalizacja"
 },
 {
  "QuestionID": 56,
  "nr": 21,
  "question": "Na czym polega animacja poklatkowa, klatki kluczowe.",
  "anwer": "Animacja poklatkowa to technika tworzenia ruchomych obrazów, w której poszczególne klatki są tworzone ręcznie, jedna po drugiej. W procesie animacji poklatkowej twórca rysuje lub tworzy model 3D poszczególnych klatek animacji, a następnie \"łączy\" je ze sobą, tworząc iluzję ruchu.newLineXDKlatki kluczowe to poszczególne klatki animacji, które zawierają najważniejsze zmiany lub przejścia w animacji. Klatki kluczowe są używane w celu określenia pozycji, rotacji i skali obiektów w danej chwili czasu. Programy do tworzenia animacji pozwalają na tworzenie kluczowych klatek i automatyczne interpolowanie pozostałych klatek między nimi, co pozwala na łatwiejsze i szybsze tworzenie animacji.",
  "category": "Specjalizacja"
 },
 {
  "QuestionID": 57,
  "nr": 22,
  "question": "Proszę omówić  metody i algorytmy wykrywania kolizji oraz ich zastosowania.",
  "anwer": "W świecie Unity3d mamy 3 metody wykrywania kolizji. Warto się zapoznać z każdą z nich, ponieważ mają one różne zastosowania. Wyróżniamy 3 główne typy wykrywania kolizji:newLineXDKolizja (Collision) – Jest to zwykłe „zderzenie”. Tego typu kolizji użyjemy np. na ścianie, tak by gracz w nią wbiegając został zatrzymany.newLineXDWyzwalacz (Trigger) – Jest to rodzaj kolizji w której wiemy że znaleźliśmy się w obszarze kolizji, ale nie zostajemy przez nią brutalnie zatrzymani. Taki collider można sobie wyobrazić jako fotokomórkę. Wchodzimy w jej „pole widzenia”, więc zapala światło. Ten typ kolizji można też wykorzystać np. przy tworzeniu pola widzenia przeciwnika.newLineXDRzucanie promienia (Raycasting) – Chyba najdziwniejsze wykrywanie kolizji. Jedyne którego nie otrzymamy przez dodanie komponentu. Działa to tak, że „strzelamy” promieniem z naszej postaci do przodu na pewien dystans. I możemy wykryć czy coś na linii „strzału” się znalazło. I jak się łatwo domyślić, jako zasięg działania broni palnej, najczęściej się to wykorzystuje.",
  "category": "Specjalizacja"
 },
 {
  "QuestionID": 58,
  "nr": 23,
  "question": "Proszę omówić nagrania lektorskie, dubbing",
  "anwer": "Typy nagrań możemy podzielić na 3 techniki – napisy, lektor oraz dubbing. Lektor oraz dubbing polegają na nałożeniu nowej ścieżki dźwiękowej nad oryginalną. Nagrania możemy zastosować w wielu przypadkach, lecz najpopularniejszym jest stosowanie ich jako dodatek do filmu lub prezentacji.\\n\\nNagranie lektorskie – Nagrania lektorskie to nagrania, na których lektor czyta tekst książki, filmu czy innego materiału audialnego, pozwalając słuchaczowi na zrozumienie treści. Są one często stosowane w przypadku osób z ograniczonym zakresem wzroku lub jako tłumaczenie oryginalnej ścieżki dźwiękowej na inny język. \\nGłównymi zaletami lektora nad dubbingiem jest krótszy czas oraz mniejsze koszty realizacji. Jako zaletę oraz wadę uznaję się to, że w przerwach w mówieniu lektora jesteśmy w stanie usłyszeć oryginalny dźwięk. Dźwięki takie jak muzyka oraz efekty dźwiękowe mogą być zagłuszone przez lektora. Usługi lektora zazwyczaj wykonywane są przez zewnętrzne firmy a nie przez producenta filmu.\\n\\nDubbing – jest to lektor wykonany przy pomocy wielu osób. Główną różnicą jest to, że oryginalna ścieżka dźwiękowa zostaje zmiksowana z nowymi nagraniami zazwyczaj tez w nowym języku. Dźwięk zostaje odpowiednio zbalansowany tak aby żaden z elementów nie zagłuszał pozostałych. Dubbing bywa mylony z postsynchronizacją, polegającą na tym, że aktor wcielający się na planie w daną postać w studiu nagrywa bądź dogrywa dialogi celem lepszego zsynchronizowania ich z obrazem bądź zastosowania cenzury. Za pierwszy film zdubbingowany na język polski powszechnie uważa się Królewnę Śnieżkę i siedmiu krasnoludków, do której dubbing stworzony został najprawdopodobniej w okolicach 1937 roku\\n\\nNagrania lektorskie zostały spopularyzowane w krajach byłego związku radzieckiego oraz w Polsce. W innych krajach lektor nie jest ani praktycznie nie był nigdy stosowany. W większości krajów świata dominującą formą tłumaczenia zagranicznych produkcji jest dubbing oraz napisy.",
  "category": "Specjalizacja"
 }
]
